---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedpathMaxDistance
source: html/c0407dea-96b4-4d69-ba6a-a4f0f9e89f37.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedpathMaxDistance Property

"Maximum Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedpathMaxDistance { get; }
```